---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.IsSplit
zh: 明细表
source: html/4fa2bd4a-2e6a-d4ac-eaac-0d06eec33f05.htm
---
# Autodesk.Revit.DB.ViewSchedule.IsSplit Method

**中文**: 明细表

Checks if the schedule is split.

## Syntax (C#)
```csharp
public bool IsSplit()
```

## Returns
True if the schedule is split. Otherwise false.